YCSB-outputs/citus-exec-14-1000000-b-12-rf_2-bs_7000-fs_3000.txt
/usr/local/openjdk-11/bin/java -cp /opt/ycsb/slf4j-api-1.7.30.jar:/opt/ycsb/slf4j-simple-1.7.30.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.2.14.jar:/opt/ycsb/jdbc-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/jdbc-binding/lib/commons-collections-3.2.1.jar:/opt/ycsb/jdbc-binding/lib/jdbc-binding-0.18.0-SNAPSHOT.jar:/opt/ycsb/jdbc-binding/lib/serp-1.13.1.jar:/opt/ycsb/jdbc-binding/lib/openjpa-lib-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jms_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/openjpa-kernel-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jta_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/commons-pool-1.5.4.jar:/opt/ycsb/jdbc-binding/lib/openjpa-jdbc-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.2.23.jar:/opt/ycsb/jdbc-binding/lib/commons-lang-2.4.jar site.ycsb.Client -db site.ycsb.db.JdbcDBClient -s -P /opt/ycsb/workloads/workloadb -P /opt/ycsb/jdbc-binding/conf/db.properties -p recordcount=1000000 -p operationcount=10000 -t
Command line: -db site.ycsb.db.JdbcDBClient -s -P /opt/ycsb/workloads/workloadb -P /opt/ycsb/jdbc-binding/conf/db.properties -p recordcount=1000000 -p operationcount=10000 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://10.0.2.5:5432/ycsb
2021-09-16 22:32:49:526 0 sec: 0 operations; est completion in 0 second 
Using shards: 1, batchSize:7000, fetchSize: 3000
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-09-16 22:32:59:471 10 sec: 92 operations; 9.2 current ops/sec; est completion in 17 minutes [READ: Count=90, Max=276735, Min=49152, Avg=100388.27, 90=204543, 99=276735, 99.9=276735, 99.99=276735] [UPDATE: Count=2, Max=193791, Min=152832, Avg=173312, 90=193791, 99=193791, 99.9=193791, 99.99=193791] 
2021-09-16 22:33:09:470 20 sec: 195 operations; 10.3 current ops/sec; est completion in 16 minutes [READ: Count=99, Max=2164735, Min=47552, Avg=95664.16, 90=95231, 99=141311, 99.9=2164735, 99.99=2164735] [UPDATE: Count=4, Max=145151, Min=77760, Avg=118112, 90=145151, 99=145151, 99.9=145151, 99.99=145151] 
2021-09-16 22:33:19:470 30 sec: 329 operations; 13.4 current ops/sec; est completion in 14 minutes [READ: Count=131, Max=103871, Min=46656, Avg=73330.81, 90=89855, 99=102847, 99.9=103871, 99.99=103871] [UPDATE: Count=3, Max=138623, Min=128704, Avg=133109.33, 90=138623, 99=138623, 99.9=138623, 99.99=138623] 
2021-09-16 22:33:29:470 40 sec: 399 operations; 7 current ops/sec; est completion in 16 minutes [READ: Count=67, Max=139135, Min=48160, Avg=73837.37, 90=89407, 99=119295, 99.9=139135, 99.99=139135] [UPDATE: Count=3, Max=4767743, Min=99840, Avg=1669152, 90=4767743, 99=4767743, 99.9=4767743, 99.99=4767743] 
2021-09-16 22:33:39:470 50 sec: 524 operations; 12.5 current ops/sec; est completion in 15 minutes [READ: Count=116, Max=133247, Min=46336, Avg=75698.48, 90=91647, 99=115775, 99.9=133247, 99.99=133247] [UPDATE: Count=9, Max=251903, Min=53216, Avg=133061.33, 90=169471, 99=251903, 99.9=251903, 99.99=251903] 
2021-09-16 22:33:49:470 60 sec: 657 operations; 13.3 current ops/sec; est completion in 14 minutes [READ: Count=128, Max=141951, Min=46240, Avg=73406.5, 90=89791, 99=131327, 99.9=141951, 99.99=141951] [UPDATE: Count=5, Max=177535, Min=90112, Avg=123084.8, 90=177535, 99=177535, 99.9=177535, 99.99=177535] 
2021-09-16 22:33:59:470 70 sec: 722 operations; 6.5 current ops/sec; est completion in 15 minutes [READ: Count=65, Max=140031, Min=46624, Avg=76043.32, 90=90495, 99=111743, 99.9=140031, 99.99=140031] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] 
2021-09-16 22:34:09:470 80 sec: 726 operations; 0.4 current ops/sec; est completion in 17 minutes [READ: Count=3, Max=86719, Min=84032, Avg=85792, 90=86719, 99=86719, 99.9=86719, 99.99=86719] [UPDATE: Count=1, Max=14794751, Min=14786560, Avg=14790656, 90=14794751, 99=14794751, 99.9=14794751, 99.99=14794751] 
2021-09-16 22:34:19:470 90 sec: 856 operations; 13 current ops/sec; est completion in 16 minutes [READ: Count=124, Max=140671, Min=46368, Avg=75777.81, 90=88703, 99=136191, 99.9=140671, 99.99=140671] [UPDATE: Count=6, Max=173183, Min=60992, Avg=107440, 90=172927, 99=173183, 99.9=173183, 99.99=173183] 
2021-09-16 22:34:29:470 100 sec: 987 operations; 13.1 current ops/sec; est completion in 15 minutes [READ: Count=122, Max=132479, Min=46112, Avg=73509.9, 90=88639, 99=129919, 99.9=132479, 99.99=132479] [UPDATE: Count=9, Max=162815, Min=77632, Avg=105781.33, 90=131711, 99=162815, 99.9=162815, 99.99=162815] 
2021-09-16 22:34:39:470 110 sec: 1117 operations; 13 current ops/sec; est completion in 14 minutes [READ: Count=122, Max=138239, Min=46752, Avg=73233.84, 90=89279, 99=132607, 99.9=138239, 99.99=138239] [UPDATE: Count=8, Max=212479, Min=49600, Avg=128102, 90=198911, 99=212479, 99.9=212479, 99.99=212479] 
2021-09-16 22:34:49:470 120 sec: 1251 operations; 13.4 current ops/sec; est completion in 14 minutes [READ: Count=128, Max=139775, Min=46976, Avg=73116.75, 90=88959, 99=134271, 99.9=139775, 99.99=139775] [UPDATE: Count=6, Max=149247, Min=88448, Avg=115317.33, 90=132095, 99=149247, 99.9=149247, 99.99=149247] 
2021-09-16 22:34:59:470 130 sec: 1373 operations; 12.2 current ops/sec; est completion in 13 minutes [READ: Count=114, Max=124159, Min=47872, Avg=72807.86, 90=88191, 99=107519, 99.9=124159, 99.99=124159] [UPDATE: Count=8, Max=771071, Min=86144, Avg=209424, 90=170495, 99=771071, 99.9=771071, 99.99=771071] 
2021-09-16 22:35:09:471 140 sec: 1453 operations; 8 current ops/sec; est completion in 13 minutes [READ: Count=76, Max=98111, Min=46624, Avg=72916.84, 90=91391, 99=97727, 99.9=98111, 99.99=98111] [UPDATE: Count=4, Max=170879, Min=95424, Avg=128160, 90=170879, 99=170879, 99.9=170879, 99.99=170879] 
2021-09-16 22:35:19:471 150 sec: 1501 operations; 4.8 current ops/sec; est completion in 14 minutes [READ: Count=42, Max=122047, Min=48096, Avg=76273.52, 90=92543, 99=122047, 99.9=122047, 99.99=122047] [UPDATE: Count=6, Max=10231807, Min=86720, Avg=1798074.67, 90=152575, 99=10231807, 99.9=10231807, 99.99=10231807] 
2021-09-16 22:35:29:470 160 sec: 1625 operations; 12.4 current ops/sec; est completion in 13 minutes [READ: Count=117, Max=133503, Min=48288, Avg=78421.74, 90=90559, 99=126463, 99.9=133503, 99.99=133503] [UPDATE: Count=7, Max=145023, Min=88448, Avg=112201.14, 90=138367, 99=145023, 99.9=145023, 99.99=145023] 
2021-09-16 22:35:39:470 170 sec: 1756 operations; 13.1 current ops/sec; est completion in 13 minutes [READ: Count=121, Max=143487, Min=46976, Avg=73051.9, 90=89087, 99=142975, 99.9=143487, 99.99=143487] [UPDATE: Count=10, Max=150655, Min=49696, Avg=117777.6, 90=144255, 99=150655, 99.9=150655, 99.99=150655] 
2021-09-16 22:35:49:470 180 sec: 1888 operations; 13.2 current ops/sec; est completion in 12 minutes [READ: Count=126, Max=142463, Min=47200, Avg=73280.25, 90=88703, 99=138751, 99.9=142463, 99.99=142463] [UPDATE: Count=6, Max=162687, Min=87296, Avg=117120, 90=140031, 99=162687, 99.9=162687, 99.99=162687] 
2021-09-16 22:35:59:470 190 sec: 1992 operations; 10.4 current ops/sec; est completion in 12 minutes [READ: Count=97, Max=129599, Min=46272, Avg=72853.94, 90=89599, 99=114943, 99.9=129599, 99.99=129599] [UPDATE: Count=7, Max=2277375, Min=74624, Avg=424182.86, 90=164863, 99=2277375, 99.9=2277375, 99.99=2277375] 
2021-09-16 22:36:09:470 200 sec: 2126 operations; 13.4 current ops/sec; est completion in 12 minutes [READ: Count=129, Max=114687, Min=46080, Avg=72693.09, 90=89087, 99=110655, 99.9=114687, 99.99=114687] [UPDATE: Count=5, Max=171007, Min=88192, Avg=126316.8, 90=171007, 99=171007, 99.9=171007, 99.99=171007] 
2021-09-16 22:36:19:470 210 sec: 2258 operations; 13.2 current ops/sec; est completion in 12 minutes [READ: Count=126, Max=154239, Min=47232, Avg=73274.16, 90=88831, 99=140927, 99.9=154239, 99.99=154239] [UPDATE: Count=6, Max=165247, Min=83200, Avg=120266.67, 90=149759, 99=165247, 99.9=165247, 99.99=165247] 
2021-09-16 22:36:29:470 220 sec: 2389 operations; 13.1 current ops/sec; est completion in 11 minutes [READ: Count=127, Max=150783, Min=45888, Avg=74688.5, 90=88383, 99=141439, 99.9=150783, 99.99=150783] [UPDATE: Count=4, Max=148095, Min=94016, Avg=118280, 90=148095, 99=148095, 99.9=148095, 99.99=148095] 
2021-09-16 22:36:39:470 230 sec: 2520 operations; 13.1 current ops/sec; est completion in 11 minutes [READ: Count=122, Max=142847, Min=46304, Avg=75070.69, 90=90047, 99=135679, 99.9=142847, 99.99=142847] [UPDATE: Count=9, Max=137471, Min=56064, Avg=96318.22, 90=114111, 99=137471, 99.9=137471, 99.99=137471] 
2021-09-16 22:36:49:470 240 sec: 2655 operations; 13.5 current ops/sec; est completion in 11 minutes [READ: Count=132, Max=147583, Min=46816, Avg=73070.91, 90=88511, 99=141567, 99.9=147583, 99.99=147583] [UPDATE: Count=3, Max=125951, Min=83840, Avg=98933.33, 90=125951, 99=125951, 99.9=125951, 99.99=125951] 
2021-09-16 22:36:59:470 250 sec: 2791 operations; 13.6 current ops/sec; est completion in 10 minutes [READ: Count=132, Max=149247, Min=46784, Avg=72402.06, 90=89087, 99=138367, 99.9=149247, 99.99=149247] [UPDATE: Count=4, Max=153471, Min=94208, Avg=125248, 90=153471, 99=153471, 99.9=153471, 99.99=153471] 
2021-09-16 22:37:09:470 260 sec: 2918 operations; 12.7 current ops/sec; est completion in 10 minutes [READ: Count=121, Max=138623, Min=46432, Avg=76721.98, 90=97727, 99=135039, 99.9=138623, 99.99=138623] [UPDATE: Count=6, Max=149887, Min=85376, Avg=115226.67, 90=135935, 99=149887, 99.9=149887, 99.99=149887] 
2021-09-16 22:37:19:470 270 sec: 3051 operations; 13.3 current ops/sec; est completion in 10 minutes [READ: Count=121, Max=133375, Min=46592, Avg=72028.83, 90=88703, 99=128447, 99.9=133375, 99.99=133375] [UPDATE: Count=12, Max=167807, Min=57984, Avg=105740, 90=152831, 99=167807, 99.9=167807, 99.99=167807] 
2021-09-16 22:37:29:470 280 sec: 3182 operations; 13.1 current ops/sec; est completion in 10 minutes [READ: Count=125, Max=147711, Min=46880, Avg=72957.82, 90=88639, 99=140159, 99.9=147711, 99.99=147711] [UPDATE: Count=6, Max=166143, Min=85248, Avg=130602.67, 90=157695, 99=166143, 99.9=166143, 99.99=166143] 
2021-09-16 22:37:39:471 290 sec: 3288 operations; 10.6 current ops/sec; est completion in 9 minutes [READ: Count=99, Max=1757183, Min=48032, Avg=93973.66, 90=89023, 99=151551, 99.9=1757183, 99.99=1757183] [UPDATE: Count=7, Max=155775, Min=89344, Avg=114025.14, 90=149119, 99=155775, 99.9=155775, 99.99=155775] 
2021-09-16 22:37:49:470 300 sec: 3418 operations; 13 current ops/sec; est completion in 9 minutes [READ: Count=117, Max=146687, Min=46784, Avg=74074.39, 90=91711, 99=145791, 99.9=146687, 99.99=146687] [UPDATE: Count=13, Max=165503, Min=51392, Avg=100417.23, 90=141695, 99=165503, 99.9=165503, 99.99=165503] 
2021-09-16 22:37:59:470 310 sec: 3546 operations; 12.8 current ops/sec; est completion in 9 minutes [READ: Count=125, Max=130751, Min=46496, Avg=76854.4, 90=90111, 99=125439, 99.9=130751, 99.99=130751] [UPDATE: Count=3, Max=195327, Min=97088, Avg=133034.67, 90=195327, 99=195327, 99.9=195327, 99.99=195327] 
2021-09-16 22:38:09:470 320 sec: 3673 operations; 12.7 current ops/sec; est completion in 9 minutes [READ: Count=120, Max=144255, Min=46528, Avg=75217.07, 90=89279, 99=133759, 99.9=144255, 99.99=144255] [UPDATE: Count=7, Max=204799, Min=88320, Avg=138907.43, 90=170623, 99=204799, 99.9=204799, 99.99=204799] 
2021-09-16 22:38:19:470 330 sec: 3803 operations; 13 current ops/sec; est completion in 8 minutes [READ: Count=124, Max=131327, Min=47424, Avg=74745.29, 90=89151, 99=131327, 99.9=131327, 99.99=131327] [UPDATE: Count=6, Max=152063, Min=70400, Avg=118490.67, 90=141439, 99=152063, 99.9=152063, 99.99=152063] 
2021-09-16 22:38:29:470 340 sec: 3929 operations; 12.6 current ops/sec; est completion in 8 minutes [READ: Count=117, Max=148479, Min=47520, Avg=76515.56, 90=91455, 99=146303, 99.9=148479, 99.99=148479] [UPDATE: Count=9, Max=166655, Min=80896, Avg=114304, 90=141695, 99=166655, 99.9=166655, 99.99=166655] 
2021-09-16 22:38:39:470 350 sec: 4060 operations; 13.1 current ops/sec; est completion in 8 minutes [READ: Count=126, Max=144767, Min=46816, Avg=75648.38, 90=88639, 99=136703, 99.9=144767, 99.99=144767] [UPDATE: Count=5, Max=102975, Min=82112, Avg=89977.6, 90=102975, 99=102975, 99.9=102975, 99.99=102975] 
2021-09-16 22:38:49:470 360 sec: 4190 operations; 13 current ops/sec; est completion in 8 minutes [READ: Count=123, Max=123967, Min=46944, Avg=75314.99, 90=89343, 99=121727, 99.9=123967, 99.99=123967] [UPDATE: Count=7, Max=148351, Min=80640, Avg=102217.14, 90=106431, 99=148351, 99.9=148351, 99.99=148351] 
2021-09-16 22:38:59:470 370 sec: 4275 operations; 8.5 current ops/sec; est completion in 8 minutes [READ: Count=80, Max=132095, Min=48160, Avg=76634.6, 90=88831, 99=126719, 99.9=132095, 99.99=132095] [UPDATE: Count=5, Max=3606527, Min=61760, Avg=782960, 90=3606527, 99=3606527, 99.9=3606527, 99.99=3606527] 
2021-09-16 22:39:09:470 380 sec: 4402 operations; 12.7 current ops/sec; est completion in 8 minutes [READ: Count=119, Max=134271, Min=46976, Avg=76452.71, 90=89023, 99=117951, 99.9=134271, 99.99=134271] [UPDATE: Count=8, Max=159103, Min=79424, Avg=104656, 90=136575, 99=159103, 99.9=159103, 99.99=159103] 
2021-09-16 22:39:19:470 390 sec: 4530 operations; 12.8 current ops/sec; est completion in 7 minutes [READ: Count=123, Max=133119, Min=47328, Avg=76774.89, 90=89343, 99=132223, 99.9=133119, 99.99=133119] [UPDATE: Count=5, Max=125439, Min=93312, Avg=111123.2, 90=125439, 99=125439, 99.9=125439, 99.99=125439] 
2021-09-16 22:39:29:470 400 sec: 4662 operations; 13.2 current ops/sec; est completion in 7 minutes [READ: Count=126, Max=119871, Min=46848, Avg=74370.29, 90=88703, 99=117119, 99.9=119871, 99.99=119871] [UPDATE: Count=6, Max=196991, Min=81024, Avg=113056, 90=134271, 99=196991, 99.9=196991, 99.99=196991] 
2021-09-16 22:39:39:470 410 sec: 4787 operations; 12.5 current ops/sec; est completion in 7 minutes [READ: Count=123, Max=138239, Min=47584, Avg=74831.22, 90=89343, 99=129343, 99.9=138239, 99.99=138239] [UPDATE: Count=2, Max=77695, Min=76672, Avg=77184, 90=77695, 99=77695, 99.9=77695, 99.99=77695] 
2021-09-16 22:39:49:470 420 sec: 4891 operations; 10.4 current ops/sec; est completion in 7 minutes [READ: Count=100, Max=135935, Min=46560, Avg=71093.12, 90=89535, 99=128511, 99.9=135935, 99.99=135935] [UPDATE: Count=4, Max=3196927, Min=48896, Avg=876332, 90=3196927, 99=3196927, 99.9=3196927, 99.99=3196927] 
2021-09-16 22:39:59:470 430 sec: 5028 operations; 13.7 current ops/sec; est completion in 7 minutes [READ: Count=132, Max=129919, Min=47136, Avg=71343.15, 90=88767, 99=119039, 99.9=129919, 99.99=129919] [UPDATE: Count=5, Max=135551, Min=97984, Avg=111539.2, 90=135551, 99=135551, 99.9=135551, 99.99=135551] 
2021-09-16 22:40:09:471 440 sec: 5099 operations; 7.1 current ops/sec; est completion in 7 minutes [READ: Count=67, Max=136959, Min=46336, Avg=76117.73, 90=89023, 99=124991, 99.9=136959, 99.99=136959] [UPDATE: Count=4, Max=4542463, Min=107328, Avg=1234592, 90=4542463, 99=4542463, 99.9=4542463, 99.99=4542463] 
2021-09-16 22:40:19:470 450 sec: 5227 operations; 12.8 current ops/sec; est completion in 6 minutes [READ: Count=122, Max=127359, Min=48384, Avg=76363.41, 90=90047, 99=125951, 99.9=127359, 99.99=127359] [UPDATE: Count=6, Max=161151, Min=79040, Avg=104682.67, 90=143999, 99=161151, 99.9=161151, 99.99=161151] 
2021-09-16 22:40:29:470 460 sec: 5360 operations; 13.3 current ops/sec; est completion in 6 minutes [READ: Count=126, Max=124863, Min=46272, Avg=74275.3, 90=90623, 99=117887, 99.9=124863, 99.99=124863] [UPDATE: Count=7, Max=141311, Min=59744, Avg=94548.57, 90=109695, 99=141311, 99.9=141311, 99.99=141311] 
2021-09-16 22:40:39:470 470 sec: 5491 operations; 13.1 current ops/sec; est completion in 6 minutes [READ: Count=124, Max=134655, Min=46304, Avg=73787.87, 90=90367, 99=130559, 99.9=134655, 99.99=134655] [UPDATE: Count=7, Max=159999, Min=82496, Avg=111844.57, 90=114431, 99=159999, 99.9=159999, 99.99=159999] 
2021-09-16 22:40:49:470 480 sec: 5621 operations; 13 current ops/sec; est completion in 6 minutes [READ: Count=126, Max=135935, Min=46880, Avg=76821.97, 90=89407, 99=111935, 99.9=135935, 99.99=135935] [UPDATE: Count=4, Max=117631, Min=77568, Avg=99104, 90=117631, 99=117631, 99.9=117631, 99.99=117631] 
2021-09-16 22:40:59:470 490 sec: 5758 operations; 13.7 current ops/sec; est completion in 6 minutes [READ: Count=131, Max=134527, Min=47136, Avg=70768.24, 90=88959, 99=123327, 99.9=134527, 99.99=134527] [UPDATE: Count=6, Max=155519, Min=88768, Avg=112704, 90=140415, 99=155519, 99.9=155519, 99.99=155519] 
2021-09-16 22:41:09:470 500 sec: 5893 operations; 13.5 current ops/sec; est completion in 5 minutes [READ: Count=130, Max=135679, Min=46624, Avg=73950.4, 90=89087, 99=127359, 99.9=135679, 99.99=135679] [UPDATE: Count=5, Max=83199, Min=52512, Avg=75862.4, 90=83199, 99=83199, 99.9=83199, 99.99=83199] 
2021-09-16 22:41:19:470 510 sec: 6029 operations; 13.6 current ops/sec; est completion in 5 minutes [READ: Count=129, Max=133375, Min=46272, Avg=72417.36, 90=88959, 99=129215, 99.9=133375, 99.99=133375] [UPDATE: Count=7, Max=142335, Min=49120, Avg=99856, 90=133247, 99=142335, 99.9=142335, 99.99=142335] 
2021-09-16 22:41:29:470 520 sec: 6162 operations; 13.3 current ops/sec; est completion in 5 minutes [READ: Count=126, Max=131583, Min=46912, Avg=72907.81, 90=89279, 99=115903, 99.9=131583, 99.99=131583] [UPDATE: Count=7, Max=155007, Min=81280, Avg=107529.14, 90=114303, 99=155007, 99.9=155007, 99.99=155007] 
2021-09-16 22:41:39:470 530 sec: 6291 operations; 12.9 current ops/sec; est completion in 5 minutes [READ: Count=124, Max=129535, Min=46816, Avg=75912, 90=89663, 99=129343, 99.9=129535, 99.99=129535] [UPDATE: Count=5, Max=198271, Min=69952, Avg=119897.6, 90=198271, 99=198271, 99.9=198271, 99.99=198271] 
2021-09-16 22:41:49:470 540 sec: 6429 operations; 13.8 current ops/sec; est completion in 5 minutes [READ: Count=130, Max=126143, Min=47040, Avg=70647.63, 90=88447, 99=115647, 99.9=126143, 99.99=126143] [UPDATE: Count=8, Max=151679, Min=76608, Avg=105076, 90=128639, 99=151679, 99.9=151679, 99.99=151679] 
2021-09-16 22:41:59:470 550 sec: 6521 operations; 9.2 current ops/sec; est completion in 4 minutes [READ: Count=89, Max=131839, Min=46272, Avg=76286.92, 90=88959, 99=117375, 99.9=131839, 99.99=131839] [UPDATE: Count=3, Max=3000319, Min=50496, Avg=1051386.67, 90=3000319, 99=3000319, 99.9=3000319, 99.99=3000319] 
2021-09-16 22:42:09:470 560 sec: 6572 operations; 5.1 current ops/sec; est completion in 4 minutes [READ: Count=48, Max=135679, Min=46784, Avg=75760, 90=89599, 99=135679, 99.9=135679, 99.99=135679] [UPDATE: Count=3, Max=147071, Min=77248, Avg=108096, 90=147071, 99=147071, 99.9=147071, 99.99=147071] 
2021-09-16 22:42:19:470 570 sec: 6680 operations; 10.8 current ops/sec; est completion in 4 minutes [READ: Count=103, Max=124863, Min=46624, Avg=69758.91, 90=87999, 99=117823, 99.9=124863, 99.99=124863] [UPDATE: Count=5, Max=8519679, Min=79296, Avg=1782694.4, 90=8519679, 99=8519679, 99.9=8519679, 99.99=8519679] 
2021-09-16 22:42:29:470 580 sec: 6809 operations; 12.9 current ops/sec; est completion in 4 minutes [READ: Count=122, Max=111551, Min=46688, Avg=74321.31, 90=88511, 99=109055, 99.9=111551, 99.99=111551] [UPDATE: Count=7, Max=206079, Min=86208, Avg=122656, 90=145279, 99=206079, 99.9=206079, 99.99=206079] 
2021-09-16 22:42:39:470 590 sec: 6906 operations; 9.7 current ops/sec; est completion in 4 minutes [READ: Count=93, Max=134911, Min=46624, Avg=75254.37, 90=88959, 99=131711, 99.9=134911, 99.99=134911] [UPDATE: Count=4, Max=2684927, Min=82048, Avg=765120, 90=2684927, 99=2684927, 99.9=2684927, 99.99=2684927] 
2021-09-16 22:42:49:470 600 sec: 7032 operations; 12.6 current ops/sec; est completion in 4 minutes [READ: Count=117, Max=124479, Min=47008, Avg=72334.5, 90=88447, 99=111743, 99.9=124479, 99.99=124479] [UPDATE: Count=9, Max=151807, Min=53280, Avg=103237.33, 90=133503, 99=151807, 99.9=151807, 99.99=151807] 
2021-09-16 22:42:59:470 610 sec: 7137 operations; 10.5 current ops/sec; est completion in 4 minutes [READ: Count=98, Max=131583, Min=46816, Avg=75030.37, 90=89855, 99=126975, 99.9=131583, 99.99=131583] [UPDATE: Count=7, Max=2725887, Min=61728, Avg=465209.14, 90=110463, 99=2725887, 99.9=2725887, 99.99=2725887] 
2021-09-16 22:43:09:470 620 sec: 7269 operations; 13.2 current ops/sec; est completion in 3 minutes [READ: Count=128, Max=138879, Min=46368, Avg=74305.62, 90=89727, 99=128767, 99.9=138879, 99.99=138879] [UPDATE: Count=4, Max=140671, Min=82624, Avg=100088, 90=140671, 99=140671, 99.9=140671, 99.99=140671] 
2021-09-16 22:43:19:470 630 sec: 7399 operations; 13 current ops/sec; est completion in 3 minutes [READ: Count=125, Max=116863, Min=47040, Avg=76075.65, 90=89983, 99=116415, 99.9=116863, 99.99=116863] [UPDATE: Count=5, Max=138879, Min=78976, Avg=105843.2, 90=138879, 99=138879, 99.9=138879, 99.99=138879] 
2021-09-16 22:43:29:470 640 sec: 7532 operations; 13.3 current ops/sec; est completion in 3 minutes [READ: Count=129, Max=125567, Min=46720, Avg=74095.63, 90=89343, 99=108543, 99.9=125567, 99.99=125567] [UPDATE: Count=4, Max=143103, Min=86080, Avg=115280, 90=143103, 99=143103, 99.9=143103, 99.99=143103] 
2021-09-16 22:43:39:470 650 sec: 7662 operations; 13 current ops/sec; est completion in 3 minutes [READ: Count=124, Max=129151, Min=46464, Avg=75490.06, 90=88639, 99=126399, 99.9=129151, 99.99=129151] [UPDATE: Count=6, Max=146815, Min=77184, Avg=107258.67, 90=119295, 99=146815, 99.9=146815, 99.99=146815] 
2021-09-16 22:43:49:470 660 sec: 7800 operations; 13.8 current ops/sec; est completion in 3 minutes [READ: Count=132, Max=125247, Min=46496, Avg=70691.52, 90=88383, 99=125183, 99.9=125247, 99.99=125247] [UPDATE: Count=6, Max=151551, Min=64096, Avg=111053.33, 90=132863, 99=151551, 99.9=151551, 99.99=151551] 
2021-09-16 22:43:59:470 670 sec: 7926 operations; 12.6 current ops/sec; est completion in 2 minutes [READ: Count=115, Max=128767, Min=46144, Avg=77086.89, 90=91327, 99=125951, 99.9=128767, 99.99=128767] [UPDATE: Count=11, Max=145535, Min=78784, Avg=102071.27, 90=143359, 99=145535, 99.9=145535, 99.99=145535] 
2021-09-16 22:44:09:470 680 sec: 8017 operations; 9.1 current ops/sec; est completion in 2 minutes [READ: Count=82, Max=2887679, Min=46400, Avg=109077.85, 90=88767, 99=131455, 99.9=2887679, 99.99=2887679] [UPDATE: Count=9, Max=209407, Min=81536, Avg=115136, 90=128511, 99=209407, 99.9=209407, 99.99=209407] 
2021-09-16 22:44:19:470 690 sec: 8107 operations; 9 current ops/sec; est completion in 2 minutes [READ: Count=88, Max=135295, Min=47680, Avg=76389.09, 90=89087, 99=126591, 99.9=135295, 99.99=135295] [UPDATE: Count=2, Max=122367, Min=78208, Avg=100288, 90=122367, 99=122367, 99.9=122367, 99.99=122367] 
2021-09-16 22:44:29:470 700 sec: 8215 operations; 10.8 current ops/sec; est completion in 2 minutes [READ: Count=100, Max=136191, Min=46816, Avg=74075.04, 90=88703, 99=130367, 99.9=136191, 99.99=136191] [UPDATE: Count=8, Max=4976639, Min=77440, Avg=707272, 90=141439, 99=4976639, 99.9=4976639, 99.99=4976639] 
2021-09-16 22:44:39:470 710 sec: 8348 operations; 13.3 current ops/sec; est completion in 2 minutes [READ: Count=124, Max=120191, Min=46560, Avg=73094.32, 90=89279, 99=116799, 99.9=120191, 99.99=120191] [UPDATE: Count=9, Max=136319, Min=81536, Avg=101148.44, 90=111231, 99=136319, 99.9=136319, 99.99=136319] 
2021-09-16 22:44:49:470 720 sec: 8462 operations; 11.4 current ops/sec; est completion in 2 minutes [READ: Count=107, Max=137855, Min=46368, Avg=73322.77, 90=89983, 99=121663, 99.9=137855, 99.99=137855] [UPDATE: Count=7, Max=1589247, Min=85568, Avg=312036.57, 90=123391, 99=1589247, 99.9=1589247, 99.99=1589247] 
2021-09-16 22:44:59:470 730 sec: 8593 operations; 13.1 current ops/sec; est completion in 2 minutes [READ: Count=126, Max=130303, Min=46976, Avg=73176.13, 90=89151, 99=126783, 99.9=130303, 99.99=130303] [UPDATE: Count=5, Max=199551, Min=96704, Avg=153798.4, 90=199551, 99=199551, 99.9=199551, 99.99=199551] 
2021-09-16 22:45:09:470 740 sec: 8732 operations; 13.9 current ops/sec; est completion in 1 minute [READ: Count=134, Max=137983, Min=46176, Avg=71172.18, 90=88895, 99=135935, 99.9=137983, 99.99=137983] [UPDATE: Count=5, Max=108031, Min=79808, Avg=93676.8, 90=108031, 99=108031, 99.9=108031, 99.99=108031] 
2021-09-16 22:45:19:470 750 sec: 8866 operations; 13.4 current ops/sec; est completion in 1 minute [READ: Count=131, Max=134015, Min=46272, Avg=72966.23, 90=88767, 99=113599, 99.9=134015, 99.99=134015] [UPDATE: Count=3, Max=172287, Min=89280, Avg=128597.33, 90=172287, 99=172287, 99.9=172287, 99.99=172287] 
2021-09-16 22:45:29:470 760 sec: 8998 operations; 13.2 current ops/sec; est completion in 1 minute [READ: Count=129, Max=141951, Min=46400, Avg=74815.5, 90=89919, 99=134911, 99.9=141951, 99.99=141951] [UPDATE: Count=3, Max=144127, Min=135936, Avg=139157.33, 90=144127, 99=144127, 99.9=144127, 99.99=144127] 
2021-09-16 22:45:39:470 770 sec: 9130 operations; 13.2 current ops/sec; est completion in 1 minute [READ: Count=127, Max=134911, Min=46560, Avg=75059.02, 90=88895, 99=131327, 99.9=134911, 99.99=134911] [UPDATE: Count=5, Max=101119, Min=61120, Avg=83779.2, 90=101119, 99=101119, 99.9=101119, 99.99=101119] 
2021-09-16 22:45:49:470 780 sec: 9186 operations; 5.6 current ops/sec; est completion in 1 minute [READ: Count=52, Max=136447, Min=46528, Avg=72869.85, 90=88767, 99=91775, 99.9=136447, 99.99=136447] [UPDATE: Count=4, Max=200191, Min=78272, Avg=118920, 90=200191, 99=200191, 99.9=200191, 99.99=200191] 
2021-09-16 22:45:59:470 790 sec: 9207 operations; 2.1 current ops/sec; est completion in 1 minute [READ: Count=19, Max=131199, Min=48736, Avg=79088, 90=88127, 99=131199, 99.9=131199, 99.99=131199] [UPDATE: Count=2, Max=14139391, Min=100416, Avg=7117872, 90=14139391, 99=14139391, 99.9=14139391, 99.99=14139391] 
2021-09-16 22:46:09:470 800 sec: 9341 operations; 13.4 current ops/sec; est completion in 57 seconds [READ: Count=131, Max=122431, Min=46624, Avg=72105.4, 90=88511, 99=118399, 99.9=122431, 99.99=122431] [UPDATE: Count=3, Max=162815, Min=115136, Avg=138229.33, 90=162815, 99=162815, 99.9=162815, 99.99=162815] 
2021-09-16 22:46:19:470 810 sec: 9473 operations; 13.2 current ops/sec; est completion in 46 seconds [READ: Count=124, Max=104831, Min=46432, Avg=72901.81, 90=88831, 99=103807, 99.9=104831, 99.99=104831] [UPDATE: Count=8, Max=193791, Min=84928, Avg=134144, 90=171263, 99=193791, 99.9=193791, 99.99=193791] 
2021-09-16 22:46:29:470 820 sec: 9605 operations; 13.2 current ops/sec; est completion in 34 seconds [READ: Count=127, Max=131583, Min=47040, Avg=74969.83, 90=88959, 99=123135, 99.9=131583, 99.99=131583] [UPDATE: Count=5, Max=112959, Min=82816, Avg=98374.4, 90=112959, 99=112959, 99.9=112959, 99.99=112959] 
2021-09-16 22:46:39:470 830 sec: 9741 operations; 13.6 current ops/sec; est completion in 23 seconds [READ: Count=130, Max=125887, Min=46720, Avg=72244.92, 90=88383, 99=119167, 99.9=125887, 99.99=125887] [UPDATE: Count=6, Max=152959, Min=79296, Avg=100986.67, 90=108735, 99=152959, 99.9=152959, 99.99=152959] 
2021-09-16 22:46:49:470 840 sec: 9875 operations; 13.4 current ops/sec; est completion in 11 seconds [READ: Count=126, Max=135423, Min=46592, Avg=73582.6, 90=89215, 99=119487, 99.9=135423, 99.99=135423] [UPDATE: Count=8, Max=112895, Min=75136, Avg=91808, 90=96511, 99=112895, 99.9=112895, 99.99=112895] 
2021-09-16 22:46:59:470 850 sec: 10000 operations; 12.5 current ops/sec; [READ: Count=117, Max=138367, Min=46944, Avg=75615.86, 90=90047, 99=137471, 99.9=138367, 99.99=138367] [UPDATE: Count=8, Max=144511, Min=77440, Avg=109112, 90=137215, 99=144511, 99.9=144511, 99.99=144511] 
2021-09-16 22:47:09:470 860 sec: 10000 operations; 0 current ops/sec; [READ: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] 
2021-09-16 22:47:17:552 868 sec: 10000 operations; 0 current ops/sec; [READ: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] [CLEANUP: Count=1, Max=18399231, Min=18382848, Avg=18391040, 90=18399231, 99=18399231, 99.9=18399231, 99.99=18399231] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] 
[OVERALL], RunTime(ms), 868083
[OVERALL], Throughput(ops/sec), 11.519635795194699
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 41
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.004723050676029827
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 41
[TOTAL_GC_TIME_%], Time(%), 0.004723050676029827
[READ], Operations, 9509
[READ], AverageLatency(us), 75082.24040382795
[READ], MinLatency(us), 45888
[READ], MaxLatency(us), 2887679
[READ], 95thPercentileLatency(us), 94399
[READ], 99thPercentileLatency(us), 132095
[READ], Return=OK, 9509
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1.839104E7
[CLEANUP], MinLatency(us), 18382848
[CLEANUP], MaxLatency(us), 18399231
[CLEANUP], 95thPercentileLatency(us), 18399231
[CLEANUP], 99thPercentileLatency(us), 18399231
[UPDATE], Operations, 491
[UPDATE], AverageLatency(us), 274137.0916496945
[UPDATE], MinLatency(us), 48896
[UPDATE], MaxLatency(us), 14794751
[UPDATE], 95thPercentileLatency(us), 196991
[UPDATE], 99thPercentileLatency(us), 4767743
[UPDATE], Return=OK, 491